import fs from "fs";
import path from "path";
import axios from "axios";

const userDataFile = path.join(process.cwd(), 'pontsData.json');
const tempImageFilePath = path.join(process.cwd(), "cache", "characters.jpg");

// Ensure the existence of the user data file
if (!fs.existsSync(userDataFile)) {
    fs.writeFileSync(userDataFile, '{}');
}

export default {
    name: "تخمين",
    author: "kaguya project",
    role: "member",
    description: "تخمين اسم شخصيات الانمي من خلال الوصف والفوز بالنقاط",
    execute: async function ({ api, event, Economy }) {
        try {
            const questions = [
                // إضافة خاصية الصورة لكل سؤال

  { 
    question: "شخصية خيالية في انمي ناروتو، كان يعتقد أنّه قد لقى حتفه خلال حرب النينجا العظمى الثالثة، ينتمي لعشيرة الأوتشيها وفي لحظاته الأخيرة أعطى لزميله في الفريق كاكاشي هاتاكي عين الشارينغان كهدية لترقيته لرتبة جونين، بعدها أنقذ من قبل أوتشيها مادارا، تأثر أوبيتو كثيرا إثر فقدانه لزميلته في الفريق رين نوهارا", 
    answer: "اوبيتو", 
    image: "https://i.imgur.com/zG4ehpe.png" 
  },
  { 
    question: "شخص شرير ويسعى إلى الخلود الأبدي من خلال التقنيات المحظورة التي قام بتطويرها، اكتشفه ساروتوبي الهوكاجي الثالث وأستاذه وهو يقوم بتطوير تقنياته لكنه هرب فقد كان تلميذا للهوكاجي الثالث وكان ساروتوبي يشعر بحقده وشره منذ صغره وكان فريقه يضم (جيرايا - تسونادي) وهم الثلاثة يدعون بالنينجا الأسطوريين،", 
    answer: "اوروتشيمارو", 
    image: "https://i.imgur.com/qQK7r3E.jpeg" 
  },
  { 
    question: "شخصية خيالية من تأليف إييتشيرو أودا. هو قناص طاقم قبعة القش وحلمه أن يصبح رجل البحر الأول الذي لا يهاب شيء وقوته لا بأس بها بحيث يمكنه الدفاع عن نفسه. ورغم قوته القليلة وجبنه الشديد إلا أنه مخادع وكاذب كبير ويستطيع أن يخرج من أزمات في ذكائه وخداع الأعداء. وهو أيضاً عاش طفولة قاسية بعد هجر والده لبيته وزوجته وتركه وحيدًا وخرج إلى البحر.", 
    answer: "اوسوب", 
    image: "https://i.imgur.com/HkJ5D24.png" 
  },
  { 
    question: "أحد شخصيات أنمي ون بيس، و هو الأدميرال السابق للبحرية و أول الادمرالات ظهوراً، و لكن بعد هزيمته من ساكازوكي (أكاينو) استقال من منصبه كجنرال و تحالف مع قراصنة اللحية السوداء.", 
    answer: "اوكيجي", 
    image: "https://i.imgur.com/febnZ0y.jpeg" 
  },
  { 
    question: "شخصية خيالية، والبطل الرئيسي في سلسلة هجوم العمالقة. ينحدر من بلدة شيغانشينا، وهي بلدة قرب السور الأول ماريا. لديه صديقاه المقربان ميكاسا أكرمان وأرمين أرليرت انضموا إلى فيلق الاستكشاف بعد أن اجتاح العمالقة بلدتهم. لديه ثأر شخصي ضد العمالقة وهدفه هو القضاء عليهم وإبادتهم جميعا", 
    answer: "ايرين", 
    image: "https://i.imgur.com/gAHKduw.png" 
  },
  { 
    question: "أحد شخصيات عالم النينجا الخيالي الذي ابتكره ماساشي كيشيموتو في سلسلة مانغا وأنمي ناروتو هو الأخ الأكبر لساسكي، وهو المسؤول عن قتل جميع أفراد عشيرتهم، يحب ساسكي على الرغم من معاملته على أنه خصم. وتبين لاحقا أنه قَتل عشيرته من أجل منع الانقلاب الذي يؤدي إلى الحرب بأوامر من القيادات العليا في كونوها", 
    answer: "ايتاشي", 
    image: "https://i.imgur.com/uP01IFu.jpeg" 
  },
  { 
    question: "شخصية خيالية من مانغا وانمي بليتش ل تايت كوبو.وهو الشخصية الأساسية في القصة هو مراهق قادر على رؤية الاشباح، تغيرت حياته عندما قابل كوتشيكي روكيا التي ستنقل إليه قدرات الشينيغامي ومعها تأتي مسؤولية محاربة الهولو وإرسال الارواح الطيبة إلى سول سوسايتي أو(مجمع الأرواح)", 
    answer: "ايتشيغو", 
    image: "https://i.imgur.com/3ImTGnT.png" 
  },
  { 
    question: "شخصي معروفة باسم ديكو (اليابانية: デ ク)، هو بطل خارق والبطل الرئيسي لسلسلة المانجا أكاديميتي للأبطال، التي أنشأها كوهي هوريكوشي وكان قدوته هو اول مايتو", 
    answer: "ميدوريا", 
    image: "https://i.imgur.com/zAP7sPD.png" 
  },
  { 
    question: "شخصية من أنمي ون بيس ظهر في الحلقة 167 في ارك سكايبيا ولديه مكافئة 500,000,000 بيلي ويلقب نفسه باانه إلاه", 
    answer: "انيل", 
    image: "https://i.imgur.com/eMswF26.jpeg" 
  },
  { 
    question: "أحد شخصيات أنمي ومانغاون بيس، والمعروف ببارتولوميو آكل لحوم البشر، وهو صديق لقبعة القش ورئيس نادي بارتو الجديد، وهو قرصان أيضا توجد على رأسه مكافأة قدرها 150.000.000 بيلي، وكان أحد المنافسين في كوروديا الكولسيوم على فاكهة ميرا ميرا نومي.", 
    answer: "بارتولوميو", 
    image: "https://i.imgur.com/aR0DAZz.png" 
  },
  { 
    question: "موسيقار طاقم قبعة القش، عبارة عن هيكل عظمي طويل القامة يملك شعر من نوع أفرو أسود اللَّون ومجعد ويرتدي قبعة سوداء اللَّون وعليها تاج ويرتدي أيضًا نظارات النجومية على شكل قلب لون العدسات زهري ولون الإطار أصفر ويرتدي أيضًا بدلة سوداء اللَّون عليها ريش أصفر اللَّون. وكذلك أيضًا يرتدي بنطال زهري اللَّون نقشت عليه ورود بيضاء اللَّون. وكذلك أيضًا يرتدي حذاء أسود اللَّون مقلم بالأصفر له كعب، وله ضحكة غريبة: يوهوهوهوهوهوهوهو.", 
    answer: "بروك", 
    image: "https://i.imgur.com/v0j9d3s.jpeg" 
  },
  { 
    question: "هو شخصية خيالية رئيسية في سلسلة ناروتو، من تأليف المؤلف مانغا الياباني ماساشي كيشيموتو. وقد ظهر لأول مرة في خاتمة سلسلة المانجا المشهورة باسم ناروتو، كإبن بطل الرواية ناروتو أوزوماكي وهيناتا هيوغا.", 
    answer: "بوروتو", 
    image: "https://i.imgur.com/q58bBoG.jpeg" 
  },
  { 
    question: "شخصية خيالية من الأنمي الياباني دراغون بول وهو شخصية ذَات قوة متوسطة وذكاء شديد وأيضًا ذو كبرياء بيكولو كان شخصًا شريرًا وأراد ان يحكم الأرض، وبعدما قتل غوكو وراديتز معًا بضربة (مامنكوسانبو) درَّب غوهان على يديه، وأصبح شخصًا طيبًا وقد غامر بنفسه لإنقاذ غوهان أكثر من مرة وبيكولو يحب غوهان وجعله مثل ابنه ويقول له أنت سوف تصبح بطلًا.", 
    answer: "بيكولا", 
    image: "https://i.imgur.com/yQCm3HI.png" 
  },
  { 
    question: "شخصية من سلسلة ون بيس يمثل قبطان وطبيب طاقم قراصنة القلب ولقبه جراح الموت، من الأزرق الشمالي وهو من الجيل الأسوأ، وكان يشغل منصب شيتشيبوكاي بعد أن قدّم لحكومة العالم 100 قلب لقراصنة مطلوبين، بعد ذلك تقابل مع لوفي في بانك هازارد ثُمّ تحالفوا بهدف إسقاط كايدو (ملك الوحوش) وهو أقوى مخلوق في العالم وكان من خططه إسقاط الشيتشيبوكاي دوفلامينغو وكانت الخطة تصفية حسابات بينه وبين دوفلامينغو عمرها أكثر من 13 سنة بعد أن قتل دوفلامينغو أخوه روزونيت (كورازون) وقد هُزم دوفلامينغو على يد تحالف بينه وبين لوفي ، وقد حققوا بعدها هدف تحالفهم وهو إسقاط اليونكو كايدو.", 
    answer: "ترافاجار دي لاو", 
    image: "https://i.imgur.com/pbDipVq.jpeg" 
  },
  { 
    question: "وهو محارب هجين نصف ساياجين ونصف أرضي والده فيجيتا ووالدته بولما وقد سافر الى بعد غوكو من اجل انقاذه بعد ان تدمر البعد اللذي كان يعيش فيه لكي لايحصل نفس الخطأ", 
    answer: "ترانكس", 
    image: "https://i.imgur.com/4b25jQP.jpeg"
  },
                  { 
                    question: "شخصية خيالية في سلسلة مانغا وأنمي ناروتو ألفها ماساشي كيشيموتو. ظهرت الشخصية في الجزء الأول من السلسلة، وكان تلميذًا للشهاب الثالث هيروزين ساروتوبي وأحد السانين الثلاثة - بالإضافة إلى أوروتشيمارو وتسونادي. يظهر على أنه رجلاً كبيرًا منحرفًا والذي يعود كل فترة إلى قريته الأم قرية الورق المخفية، بتقارير عن أوروتشيمارو ومنظمة الأكاتسكي", 
                    answer: "جيرايا", 
                    image: "https://i.imgur.com/OluJyts.png" 
                  },
                  { 
                    question: "بطل مسلسل ونبيس كان قد اكل فاكهة جومو جومو 'فاكهة المطاط' وحلمه ان يصبح ملك القراصنة بعد ان يجد كنز الون بيس", 
                    answer: "لوفي", 
                    image: "https://i.imgur.com/jAJSd7r.jpeg" 
                  },
                  { 
                    question: "ويُعرف أحيانًا في الوطن العربي باسم عبقور، هو شخصية خيالية في سلسلة المانغا اليابانية والأنمي الذي يحمل نفس الاسم التي قام بإنشاءها فيوكو فوجيو، وهو الاسم المستعار لفريق الكتابة هيروشي فوجيموتو وموتو أبيكو.و هو قط آليٌ من القرن الثاني والعشرين يسافر عبر الزمن إلى الماضي إلى القرن العشرين لمساعدة صبي مُراهق يدعى نوبيتا", 
                    answer: "دورايمون", 
                    image: "https://i.imgur.com/xFoxuOT.png" 
                  },
                  { 
                    question: "هو أحد شخصيات انمي ومانغا ون بيس، وأيضا هو كابتن قراصنة دون كيهوتي، وهو أحد التشيبوكاي السبعة سابقا قبل أن يهزم من لوفي ويتم حبسه في الامبل داون، وقد كانت مكافأته قبل ان يصبح تشيبوكاي 340.000.000  وهو وكيل في السوق السوداء تحت اسم الجوكر، وهو أيضا ملك دريسروزا بعد أن استولى على الحكم من ريكو دولدو III، ولكن تم فصله من المنصب بعد هزيمته من لوفي", 
                    answer: "دوفلامينغو", 
                    image: "https://i.imgur.com/FazFYLr.png" 
                  },
                  { 
                    question: "إحدى الشخصيات الأساسية في مانغا ون بيس التي من تاليف إييتشيرو أودا. وهو أول من انضم إلى لوفي، ويعتبر مقاتل طاقم قراصنة قبعة القش. وهو سياف طاقم قبعة القش ويستخدم تقنية الثلاث سيوف التي طورها بنفسه يتمتع بقوة بدنية كبيرة وقدرة هائلة على التحمل", 
                    answer: "زورو", 
                    image: "https://i.imgur.com/2kY8hov.png" 
                  },
                  { 
                    question: "هي شخصية وهمية والطرف الرئيسي في أنمي وسلسلة مانغا ون بيس من تأليف إييتشيرو أودا. انضم سابو إلى الجيش الثوري تحت قياده مونكي دي دراجون ويشغل حالياً منصب الرجل الثاني في الجيش الثوري. يمتلك فاكهة الشيطان الخاصة ببورتغاس دي إيس والمعروفة باسم (ميرا ميرا نومي) من نوع لوقيا النار.", 
                    answer: "سابو", 
                    image: "https://i.imgur.com/fjJ5ElD.jpeg" 
                  },
                  { 
                    question: "هو شخصية خيالية وأحد الشخصيات الرئيسية في أنمي وسلسلة المانجا ون بيس التي أنشأها إييتشيرو أودا. وهو قرصان من قراصنة قبعة القش وهو رابع عضو انضم للطاقم حيث يُعرف بدوره كطباخ للطاقم ويُلقّب بالسّاق السّوداء كذلك", 
                    answer: "سانجي", 
                    image: "https://i.imgur.com/kKFx3j1.jpeg" 
                  },
                  { 
                    question: "هو شخصية خيالية تم إنشاؤها من قبل أكيرا تورياما في عام 1984، وهو بطل سلسلة أنمي ومانغا دراغون بول.  قدم كطفل بذيل قرد، يكتشف أنه كاكاروتو، المحارب القادم من الفضاء والذي سيصبح الأقوى بينهم ويلقب بالأب الروحي للأنميات", 
                    answer: "غوكو", 
                    image: "https://i.imgur.com/LnOKuOx.png" 
                  },
                  { 
                    question: "الشخصية الرئيسة في إحدى أشهر سلاسل الأنمي. كان طالبًا في السابعة عشرة من العمر يدرس في مدرسة تيتان الثانوية، ويعرف بمحقق الثانوية حيث يساعد الشرطة في حل القضايا والعثور على المجرمين. وهو الابن الوحيد لعائلة كودو الغنية التي تركته في اليابان عندما كان عمره 14 سنة. والده هو يوساكو كودو كاتب روايات غموض، ووالدته يوكيكو كودو وهي ممثلة سابقة. يتسم بالذكاء مثل أبيه والثقة بالنفس مثل أمه. هو محقق مشهور في بلاده ،عصابة اعطته حبة ف صغر حجمه ، يتخذ من شارلوك هولمز مثلًا له ويتمنى أن يكون شارلوك هولمز عصره.", 
                    answer: "كونان", 
                    image: "https://i.imgur.com/5ymjg5R.jpeg" 
                  },
                  { 
                    question: "هو شخصية من شخصيات ناروتو كان أول ظهور له في الحلقة 26 عندما أتى مع أخويه كانكورو وتيماري لاختبار التشونين من قرية الرمل، يشتهر بفن الرمال.", 
                    answer: "غارا", 
                    image: "https://i.imgur.com/yUCd3D6.png" 
                  },
                  { 
                    question: "أحد شخصيات أنمي ومانغا ون بيس، و قد كان سابقا كابتن قراصنة القطة السوداء قبل أن يعتزل القرصنة وكانت هناك مكافأة مالية على رأسه قدرها 16,000,000 بيلي، وقد كان يتظاهر بأنه الحارس الشخصي لكايا.", 
                    answer: "كابتن كورو", 
                    image: "https://i.imgur.com/aZWvR7q.jpeg" 
                  },
                  { 
                    question: "شخصية خيالية من شخصيات ماجك كايتو، وظهر لاحقًا في سلسلة المحقق كونان كذلك للمؤلف غوشو أوياما، والده هو توتشي كوروبا (黒羽 盗؟) كان اللص الطائر الأول قبل أن يقتل في فرنسا عندما رفض سرقة جوهرة الباندورا لمنظمة شريرة", 
                    answer: "كايتو كيد", 
                    image: "https://i.imgur.com/6ckK6nT.jpeg" 
                  },
                  { 
                    question: "شخصية خيالية في مسلسل أنمي ون بيس ولقد ظهر في الحلقة الأولى من المسلسل وبعد أن ساعده لوفي على الفرار من الشريرة ألفيدا انضم إلى القوات البحرية.", 
                    answer: "كوبي", 
                    image: "https://i.imgur.com/ICVEr1p.png" 
                  },
                  { 
                    question: "وهو طالب في المرحلة الثانوية عثر على مذكرة بها قوة خارقة للطبيعة تحمل اسم مذكرة الموت بعدما قام الشينيغامي (حاصد الأرواح) المعروف باسم ريوك بإسقاطها على كوكب الأرض", 
                    answer: "ياغامي لايت", 
                    image: "https://i.imgur.com/09NjhBv.jpeg" 
                  },
                  { 
                    question: "هو شخصية رئيسية من مانغا وأنمي هجوم العمالقة وقائد فرقة خاصة في فيلق الإستطلاع ويعرف أيضاً بأنه أقوى جندي في البشرية.", 
                    answer: "ليفاي", 
                    image: "https://i.imgur.com/zW132oo.png" 
                  },
                  { 
                    question: "أحد شخصيات أنمي ومانغا ون بيس، وأحد أقوى قراصنة اللحية البيضاء، ويلقب بـالعنقاء. وهو قائد الأسطول الأول وأقوى شخص في طاقم اللحية البيضاء.", 
                    answer: "ماركو", 
                    image: "https://i.imgur.com/5BunLah.png" 
                  },
                  { 
                    question: "أحد شخصيات أنمي ومانغا «ناروتو» نينجا قوي جدا، يتميز بالهدوء والثقة بالنفس، لا يحب الإكثار في الكلام، بل يقول بإيجاز ما يريد قوله فقط، يعتبر متلاعب محترف بالآخرين، وهذا ما فعله للكيوبي، كما أنه معروف بحبه للقوة والتعطش للمزيد مهما كان مصدرها كما أنه يحب القتال بالتايجتسو أكثر من الننجتسو إلا إذا استدعت الضرورة.أحد شخصيات أنمي ومانغا «ناروتو» نينجا قوي جدا، يتميز بالهدوء والثقة بالنفس، لا يحب الإكثار في الكلام، بل يقول بإيجاز ما يريد قوله فقط، يعتبر متلاعب محترف بالآخرين، وهذا ما فعله للكيوبي، كما أنه معروف بحبه للقوة والتعطش للمزيد مهما كان مصدرها كما أنه يحب القتال بالتايجتسو أكثر من الننجتسو إلا إذا استدعت الضرورة.", 
                    answer: "مادارا", 
                    image: "https://i.imgur.com/OLzeUHD.png" 
                  },
                { 
                    question: "شخصية خيالية من تأليف هاجيمي إيساياما، وهي واحدة من الأعضاء البارزين في فيلق الاستكشاف في أنمي هجوم العمالقة. تُعرف بمهاراتها القتالية العالية وولائها العميق لأصدقائها، وخاصة لأخيها بالتبني إرين ييغر.", 
                    answer: "ميكاسا", 
                    image: "https://i.imgur.com/83wmWDQ.png" 
                  },
                { 
                    question: "شخصية خيالية من أنمي قاتل الشياطين. هي شقيقة تانجيرو الأصغر، التي تحولت إلى شيطان لكنها لا تزال تحتفظ بإنسانيتها. تتميز بقدرتها على التحول إلى شكل شيطان قوي وحساس، وتظهر ولاءً كبيراً لعائلتها.", 
                    answer: "نيزكو", 
                    image: "https://i.imgur.com/0UkUSR4.jpeg" 
                  }
            ];

            const randomQuestion = questions[Math.floor(Math.random() * questions.length)];
            const correctAnswer = randomQuestion.answer.toLowerCase();

            const message = `▱▱▱▱▱▱▱▱▱▱▱▱▱\n\t🌟 | خمن إسم الشخصية :\n\t\t\t\t${randomQuestion.question}\nرد على هذه الرسالة بالجواب الصحيح\n⚠️ | تجنب كتابة الإسم الكامل للشخصية والهمزة\n▱▱▱▱▱▱▱▱▱▱▱▱▱`;

            api.sendMessage(message, event.threadID, async (error, info) => {
                if (!error) {
                    try {
                        await Economy.getBalance(event.senderID); // التحقق من وجود معلومات الاقتصاد للمستخدم
                        client.handler.reply.set(info.messageID, {
                            author: event.senderID,
                            type: "reply",
                            name: "تخمين",
                            correctAnswer: correctAnswer,
                            image: randomQuestion.image, // إضافة الصورة
                            unsend: true
                        });
                    } catch (e) {
                        console.error("خطأ في التحقق من معلومات الاقتصاد للمستخدم:", e);
                    }
                } else {
                    console.error("خطأ في إرسال الرسالة:", error);
                }
            });
        } catch (error) {
            console.error("خطأ في تنفيذ الأمر:", error);
        }
    },
    onReply: async function ({ api, event, reply, Economy }) {
        try {
            if (reply && reply.type === "reply" && reply.name === "تخمين") {
                const userAnswer = event.body.trim().toLowerCase();
                const correctAnswer = reply.correctAnswer && reply.correctAnswer.toLowerCase();

                if (correctAnswer) {
                    const userInfo = await api.getUserInfo(event.senderID);
                    const userName = userInfo ? userInfo[event.senderID].name : "المستخدم";

                    // تحقق من وجود أي جزء من الإجابة الصحيحة في إجابة المستخدم
                    if (correctAnswer.split(' ').some(part => userAnswer.includes(part))) {
                        // تنزيل الصورة
                        const imageResponse = await axios.get(reply.image, { responseType: "arraybuffer" });
                        fs.writeFileSync(tempImageFilePath, Buffer.from(imageResponse.data, "binary"));
                        const attachment = [fs.createReadStream(tempImageFilePath)];

                        const pointsData = JSON.parse(fs.readFileSync(userDataFile, "utf8"));
                        const userPoints = pointsData[event.senderID] || { name: userName, points: 0 };
                        userPoints.points += 100;
                        pointsData[event.senderID] = userPoints;
                        fs.writeFileSync(userDataFile, JSON.stringify(pointsData, null, 2));

                        api.sendMessage(
                            { body: `◆❯━━━━━▣✦▣━━━━━━❮◆\n✅ | تهانينا يا ${userName} 🥳 لقد خمنت إسم الشخصية بشكل صحيح وربحت『 100』 نقطة\n🎯 | الجواب : ${correctAnswer}\n◆❯━━━━━▣✦▣━━━━━━❮◆`, attachment },
                            event.threadID
                        );

                        api.setMessageReaction("✅", event.messageID, (err) => {}, true);
                        api.unsendMessage(reply.messageID);
                    } else {
                        api.sendMessage(`❌ | آسفة ، لم تكن تلك الإجابة الصحيحة. حاول مرة أخرى.`, event.threadID);
                        api.setMessageReaction("❌", event.messageID, (err) => {}, true);
                    }
                } else {
                    console.error("الإجابة الصحيحة غير معروفة");
                }
            } else {
                console.error("رد غير معروف");
            }
        } catch (error) {
            console.error("حدث خطأ أثناء معالجة الرد:", error);
        }
    }
};
